# 1

In [1]:
#import libraries
import selenium
from selenium import webdriver
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

In [2]:
#connect to driver
driver = webdriver.Chrome(r"C:\Users\Konghot Vineeth Nair\Desktop\chromedriver.exe")
url="https://www.naukri.com/"
driver.get(url)

In [3]:
# entering “Data Analyst” in “Skill,Designations,Companies” field
search_field_designation=driver.find_element_by_class_name("suggestor-input ")   #job  search bar
search_field_designation.send_keys("Data Analyst")
#finding web element for job location bar
search_locn=driver.find_element_by_xpath('/html/body/div/div[2]/div[3]/div/div/div[3]/div/div/div/input')
search_locn.send_keys("Bangalore")
search_btn = driver.find_element_by_xpath("//div[@class='qsbSubmit']")
search_btn.click()

In [4]:
driver = webdriver.Chrome(r"C:\Users\Konghot Vineeth Nair\Desktop\chromedriver.exe")
url="https://www.naukri.com/data-analyst-jobs-in-bangalore?k=data%20analyst&l=bangalore/"
driver.get(url)

In [5]:
# creating empty lists for scraping data
job_title=[]
job_location=[]
company_name=[]
experience_required=[]

In [6]:
title=driver.find_elements_by_xpath("//a[@class='title fw500 ellipsis']")
for i in title:
    title1=i.text
    job_title.append(title1)
job_title[0:9]

['Senior Data Analyst',
 'Senior Data Analyst - FPG',
 'Senior Data Analyst',
 'Senior Data Analyst For a reputed E-Commerce Company at Bangalore',
 'Senior Data Analyst For a reputed E-Commerce Company at Bangalore',
 'Senior Data Analyst',
 'Data Analyst',
 'Senior Data Analyst - Data Modeling/Database Design',
 'QA Data Analyst']

In [7]:
location_tag=driver.find_elements_by_xpath("//li[@class='fleft grey-text br2 placeHolderLi location']/span[1]")
for i in location_tag:
    location=i.text
    job_location.append(location)
job_location[0:9]

['Bangalore/Bengaluru',
 'Bangalore/Bengaluru, Karnataka',
 'Bangalore/Bengaluru',
 'Bangalore/Bengaluru',
 'Bangalore/Bengaluru',
 'Bangalore/Bengaluru',
 'Bangalore/Bengaluru',
 'Bangalore/Bengaluru',
 'Bangalore/Bengaluru']

In [8]:
company_tags=driver.find_elements_by_xpath("//a[@class='subTitle ellipsis fleft']")
for i in company_tags:
    company_names=i.text
    company_name.append(company_names)
company_name[0:9]

['Flipkart',
 'Flipkart',
 'Flipkart',
 'Yellow Box HR Services Pvt. Ltd.',
 'Yellow Box HR Services Pvt. Ltd.',
 'Thomson Reuters',
 'Diverse Lynx',
 'K & R Enterprises',
 'Ralph Lauren']

In [9]:
experience_tag=driver.find_elements_by_xpath("//li[@class='fleft grey-text br2 placeHolderLi experience']/span[1]")
for i in experience_tag:
    experience=i.text
    experience_required.append(experience)
experience_required[0:9]

['3-7 Yrs',
 '3-8 Yrs',
 '4-6 Yrs',
 '3-7 Yrs',
 '3-7 Yrs',
 '2-4 Yrs',
 '1-5 Yrs',
 '4-6 Yrs',
 '0-3 Yrs']

In [10]:
jobs=pd.DataFrame({})
jobs['TITLE']=job_title[0:10]
jobs['LOCATION']=job_location[0:10]
jobs['COMPANY']=company_name[0:10]
jobs['EXPERIANCE']=experience_required[0:10]
jobs

,TITLE,LOCATION,COMPANY,EXPERIANCE
0,Senior Data Analyst,Bangalore/Bengaluru,Flipkart,3-7 Yrs
1,Senior Data Analyst - FPG,"Bangalore/Bengaluru, Karnataka",Flipkart,3-8 Yrs
2,Senior Data Analyst,Bangalore/Bengaluru,Flipkart,4-6 Yrs
3,Senior Data Analyst For a reputed E-Commerce C...,Bangalore/Bengaluru,Yellow Box HR Services Pvt. Ltd.,3-7 Yrs
4,Senior Data Analyst For a reputed E-Commerce C...,Bangalore/Bengaluru,Yellow Box HR Services Pvt. Ltd.,3-7 Yrs
5,Senior Data Analyst,Bangalore/Bengaluru,Thomson Reuters,2-4 Yrs
6,Data Analyst,Bangalore/Bengaluru,Diverse Lynx,1-5 Yrs
7,Senior Data Analyst - Data Modeling/Database D...,Bangalore/Bengaluru,K & R Enterprises,4-6 Yrs
8,QA Data Analyst,Bangalore/Bengaluru,Ralph Lauren,0-3 Yrs
9,Data analyst,Bangalore/Bengaluru,GSK India,5-9 Yrs

In [11]:
driver.close()

# 2

In [12]:
#import libraries
import selenium
from selenium import webdriver
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

In [13]:
#connect to driver
driver = webdriver.Chrome(r"C:\Users\Konghot Vineeth Nair\Desktop\chromedriver.exe")
url="https://www.naukri.com/"
driver.get(url)

In [14]:
# entering “Data Analyst” in “Skill,Designations,Companies” field
search_field_designation=driver.find_element_by_class_name("suggestor-input ")   #job  search bar
search_field_designation.send_keys("Data Scientist")
#finding web element for job location bar
search_locn=driver.find_element_by_xpath('/html/body/div/div[2]/div[3]/div/div/div[3]/div/div/div/input')
search_locn.send_keys("Bangalore")
search_btn = driver.find_element_by_xpath("//div[@class='qsbSubmit']")
search_btn.click()

In [15]:
#connect to driver
driver = webdriver.Chrome(r"C:\Users\Konghot Vineeth Nair\Desktop\chromedriver.exe")
url="https://www.naukri.com/data-analyst-jobs-in-bangalore?k=data%20analyst&l=bangalore/"
driver.get(url)

In [16]:
job_title=[]
title=driver.find_elements_by_xpath("//a[@class='title fw500 ellipsis']")
for i in title:
    title1=i.text
    job_title.append(title1)
job_title[0:9]

['Senior Data Analyst',
 'Senior Data Analyst - FPG',
 'Senior Data Analyst',
 'Senior Data Analyst For a reputed E-Commerce Company at Bangalore',
 'Senior Data Analyst For a reputed E-Commerce Company at Bangalore',
 'Senior Data Analyst',
 'Data Analyst',
 'Senior Data Analyst - Data Modeling/Database Design',
 'QA Data Analyst']

In [17]:
job_location=[]
location=driver.find_elements_by_xpath("//li[@class='fleft grey-text br2 placeHolderLi location']/span[1]")
for i in location:
    location1=i.text
    job_location.append(location1)
job_location[0:9]

['Bangalore/Bengaluru',
 'Bangalore/Bengaluru, Karnataka',
 'Bangalore/Bengaluru',
 'Bangalore/Bengaluru',
 'Bangalore/Bengaluru',
 'Bangalore/Bengaluru',
 'Bangalore/Bengaluru',
 'Bangalore/Bengaluru',
 'Bangalore/Bengaluru']

In [18]:
company_name=[]
company_tags=driver.find_elements_by_xpath("//a[@class='subTitle ellipsis fleft']")
for i in company_tags:
    company_names=i.text
    company_name.append(company_names)
company_name[0:9]

['Flipkart',
 'Flipkart',
 'Flipkart',
 'Yellow Box HR Services Pvt. Ltd.',
 'Yellow Box HR Services Pvt. Ltd.',
 'Thomson Reuters',
 'Diverse Lynx',
 'K & R Enterprises',
 'Ralph Lauren']

In [19]:
jobs=pd.DataFrame({})
jobs['TITLE']=job_title[0:10]
jobs['LOCATION']=job_location[0:10]
jobs['COMPANY']=company_name[0:10]
jobs

,TITLE,LOCATION,COMPANY
0,Senior Data Analyst,Bangalore/Bengaluru,Flipkart
1,Senior Data Analyst - FPG,"Bangalore/Bengaluru, Karnataka",Flipkart
2,Senior Data Analyst,Bangalore/Bengaluru,Flipkart
3,Senior Data Analyst For a reputed E-Commerce C...,Bangalore/Bengaluru,Yellow Box HR Services Pvt. Ltd.
4,Senior Data Analyst For a reputed E-Commerce C...,Bangalore/Bengaluru,Yellow Box HR Services Pvt. Ltd.
5,Senior Data Analyst,Bangalore/Bengaluru,Thomson Reuters
6,Data Analyst,Bangalore/Bengaluru,Diverse Lynx
7,Senior Data Analyst - Data Modeling/Database D...,Bangalore/Bengaluru,K & R Enterprises
8,QA Data Analyst,Bangalore/Bengaluru,Ralph Lauren
9,Data analyst,Bangalore/Bengaluru,GSK India

In [20]:
driver.close()

# 3

In [21]:
#import libraries
import selenium
from selenium import webdriver
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

In [22]:
#connect to driver
driver = webdriver.Chrome(r"C:\Users\Konghot Vineeth Nair\Desktop\chromedriver.exe")
url="https://www.naukri.com/"
driver.get(url)

In [23]:
# entering “Data Analyst” in “Skill,Designations,Companies” field
search_field_designation=driver.find_element_by_class_name("suggestor-input ")   #job  search bar
search_field_designation.send_keys("Data Scientist")
search_btn = driver.find_element_by_xpath("//div[@class='qsbSubmit']")
search_btn.click()

In [24]:
place= driver.find_element_by_xpath("/html/body/div[1]/div[3]/div[2]/section[1]/div[2]/div[3]/div[2]/div[3]/label/i")
place.click()

In [26]:
sal_clk=driver.find_elements_by_xpath("//span[@class='ellipsis fleft']")
for i in sal_clk:
    if i.text == '3-6 Lakhs':   
        i.click() # Checking the checkbox to apply filter on the salary
        break

In [27]:
job_title=[]
title=driver.find_elements_by_xpath("//a[@class='title fw500 ellipsis']")
for i in title:
    title1=i.text
    job_title.append(title1)
job_title

['Urgent Requirement || Data Scientist || Noida',
 'Data Analyst / Data Scientist / Business Analytics / Fresher - MNC',
 'Data Scientist/Senior Scientist - Python/Spark/Hadoop',
 'Data Scientist',
 'Hiring For Data Analyst and Data Scientist For Gurgaon Location',
 'Data Scientist',
 'Data Scientist | A Fintech Organisation',
 'Data Scientist',
 'Data Scientist',
 'Data Scientist-Onsite and offshore',
 'Data Scientist (freelance)',
 'Data & Applied Scientist',
 'Data and applied Scientist',
 'Data Scientist II',
 'Data Scientist',
 'Data Scientist',
 'Opening For Data Scientist',
 'Data Scientist',
 'Senior Data Scientist',
 'Lead Data Scientist - KYC/Fraud/Marketing']

In [28]:
job_location=[]
location=driver.find_elements_by_xpath("//li[@class='fleft grey-text br2 placeHolderLi location']/span[1]")
for i in location:
    location1=i.text
    job_location.append(location1)
job_location

['Noida, Delhi / NCR',
 'Noida, New Delhi, Delhi / NCR',
 'Gurgaon/Gurugram',
 'Hyderabad/Secunderabad, Bangalore/Bengaluru, Delhi / NCR',
 'Noida, Gurgaon/Gurugram, Delhi / NCR',
 'New Delhi',
 'Gurgaon/Gurugram',
 'Gurgaon/Gurugram, Chennai',
 'Kolkata, Hyderabad/Secunderabad, Pune, Chennai, Bangalore/Bengaluru, Delhi / NCR',
 'Hyderabad/Secunderabad, Pune, Chennai, Bangalore/Bengaluru, Delhi / NCR, Mumbai (All Areas)',
 'New Delhi, Delhi',
 'Noida, Hyderabad/Secunderabad, Bangalore/Bengaluru',
 'Noida, Hyderabad/Secunderabad, Bangalore/Bengaluru',
 'Delhi / NCR',
 'New Delhi',
 'New Delhi, Delhi / NCR, Mumbai (All Areas)',
 'Gurgaon/Gurugram',
 'Noida',
 'Delhi',
 'New Delhi']

In [29]:
company_name=[]
company_tags=driver.find_elements_by_xpath("//a[@class='subTitle ellipsis fleft']")
for i in company_tags:
    company_names=i.text
    company_name.append(company_names)
company_name

['HCL',
 'GABA Consultancy services',
 'Connexions',
 'NAVIKENZ INDIA PRIVATE LIMITED',
 'Shadow Placements',
 'CHANGE LEADERS CONSULTING',
 'Vision Beyond Resources India Private Limited',
 'DECISION POINT PRIVATE LIMITED',
 'Alp Consulting Limited',
 'PROKXIMITY',
 '2Coms',
 'Microsoft',
 'Microsoft',
 'Chegg',
 'Boston Consulting Group',
 'Cloudstrats Technologies Private Limited',
 'Care Health Insurance',
 'Stefanini',
 'iNICU',
 'Tide Software']

In [30]:
experience_required=[]
experience_tags=driver.find_elements_by_xpath("//li[@class='fleft grey-text br2 placeHolderLi experience']")
for i in experience_tags:
    experience_names=i.text
    experience_required.append(experience_names)
experience_required

['3-8 Yrs',
 '0-0 Yrs',
 '2-6 Yrs',
 '2-5 Yrs',
 '3-7 Yrs',
 '3-8 Yrs',
 '2-7 Yrs',
 '1-6 Yrs',
 '1-6 Yrs',
 '3-8 Yrs',
 '2-7 Yrs',
 '3-7 Yrs',
 '3-7 Yrs',
 '2-6 Yrs',
 '2-5 Yrs',
 '3-5 Yrs',
 '1-5 Yrs',
 '3-8 Yrs',
 '1-5 Yrs',
 '1-6 Yrs']

In [31]:
jobs=pd.DataFrame({})
jobs['TITLE']=job_title[0:10]
jobs['LOCATION']=job_location[0:10]
jobs['COMPANY']=company_name[0:10]
jobs['EXPERIENCE']=experience_required[0:10]
jobs

,TITLE,LOCATION,COMPANY,EXPERIENCE
0,Urgent Requirement || Data Scientist || Noida,"Noida, Delhi / NCR",HCL,3-8 Yrs
1,Data Analyst / Data Scientist / Business Analy...,"Noida, New Delhi, Delhi / NCR",GABA Consultancy services,0-0 Yrs
2,Data Scientist/Senior Scientist - Python/Spark...,Gurgaon/Gurugram,Connexions,2-6 Yrs
3,Data Scientist,"Hyderabad/Secunderabad, Bangalore/Bengaluru, D...",NAVIKENZ INDIA PRIVATE LIMITED,2-5 Yrs
4,Hiring For Data Analyst and Data Scientist For...,"Noida, Gurgaon/Gurugram, Delhi / NCR",Shadow Placements,3-7 Yrs
5,Data Scientist,New Delhi,CHANGE LEADERS CONSULTING,3-8 Yrs
6,Data Scientist | A Fintech Organisation,Gurgaon/Gurugram,Vision Beyond Resources India Private Limited,2-7 Yrs
7,Data Scientist,"Gurgaon/Gurugram, Chennai",DECISION POINT PRIVATE LIMITED,1-6 Yrs
8,Data Scientist,"Kolkata, Hyderabad/Secunderabad, Pune, Chennai...",Alp Consulting Limited,1-6 Yrs
9,Data Scientist-Onsite and offshore,"Hyderabad/Secunderabad, Pune, Chennai, Bangalo...",PROKXIMITY,3-8 Yrs

In [32]:
driver.close()

# 4

In [33]:
#import libraries
import selenium
from selenium import webdriver
import pandas as pd
import warnings
from time import sleep
warnings.filterwarnings('ignore')
driver = webdriver.Chrome(executable_path=r"C:\Users\Konghot Vineeth Nair\Desktop\chromedriver.exe")
driver.get('https://www.flipkart.com/')

In [35]:
# finding web elements
search= driver.find_element_by_class_name("_3704LK")
#write or type on search bar
search.send_keys("sunglasses")
search_btn = driver.find_element_by_class_name("L0Z3Pu")
search_btn.click()

In [36]:
url = "https://www.flipkart.com/search?q=sunglasses&otracker=search&otracker1=search&marketplace=FLIPKART&as-show=on&as=off"
driver.get(url)

In [37]:
page_url=[]

url=driver.find_elements_by_xpath("//nav[@class='yFHi8N']//a")
for i in url:
    page_url.append(i.get_attribute('href'))
page_url=page_url[0:3]

In [38]:
glass_brand=[]
glass_description=[]
glass_price=[]
glass_offer=[]

for i in range(3):
    print('Scraping page', i+1)
    
    brand_tag=driver.find_elements_by_xpath("//div[@class='_2WkVRV']")
    for i in brand_tag:
        brand=i.text
        glass_brand.append(brand)
    disc_tag=driver.find_elements_by_xpath("//a[@class='IRpwTa']")
    for i in disc_tag:
        description=i.text
        glass_description.append(description)

    price_tag=driver.find_elements_by_xpath("//div[@class='_30jeq3']")
    for i in price_tag:
        price=i.text
        glass_price.append(price)
        
    offer_tag=driver.find_elements_by_xpath("//div[@class='_3Ay6Sb']")
    for i in offer_tag:
        offer=i.text
        glass_offer.append(offer)

Scraping page 1
Scraping page 2
Scraping page 3

In [39]:
print(len(glass_brand),len(glass_description),len(glass_price),len(glass_offer))

120 117 120 120

In [40]:
glass=pd.DataFrame({})
glass['NAME']=glass_brand[0:100]
glass['DESCRIPTION']=glass_description[0:100]
glass['PRICE']=glass_price[0:100]
glass['OFFER']=glass_offer[0:100]
glass

,NAME,DESCRIPTION,PRICE,OFFER
0,VILLAIN,Others Wayfarer Sunglasses (Free Size),₹522,48% off
1,ROZZETTA CRAFT,"UV Protection, Gradient Retro Square Sunglasse...",₹349,83% off
2,GANSTA,"UV Protection, Riding Glasses Wayfarer Sunglas...",₹198,89% off
3,Elligator,UV Protection Round Sunglasses (54),₹248,90% off
4,SUNBEE,"UV Protection, Polarized Wayfarer Sunglasses (...",₹243,81% off
...,...,...,...,...
95,VILLAIN,UV Protection Rectangular Sunglasses (Free Size),"₹1,099",37% off
96,kingsunglasses,"by Lenskart Polarized, UV Protection Wayfarer ...",₹186,81% off
97,PHENOMENAL,"UV Protection, Gradient Rectangular Sunglasses...",₹269,73% off
98,Fastrack,UV Protection Retro Square Sunglasses (Free Size),₹607,24% off
99,VINCENT CHASE,UV Protection Wayfarer Sunglasses (53),"₹1,533",39% off

In [41]:
driver.close()

# 5

In [50]:
#import libraries
import selenium
from selenium import webdriver
import pandas as pd
import warnings
from time import sleep
warnings.filterwarnings('ignore')

driver = webdriver.Chrome(executable_path=r"C:\Users\Konghot Vineeth Nair\Desktop\chromedriver.exe")
url='https://www.flipkart.com/apple-iphone-11-black-64-gb-includes- earpods-power- adapter/p/itm0f37c2240b217?pid=MOBFKCTSVZAXUHGR&lid=LSTMOBFKC TSVZAXUHGREPBFGI&marketplace'
driver.get(url)

In [51]:
#All review
all_review = driver.find_element_by_xpath("/html/body/div[1]/div/div[3]/div[1]/div[2]/div[8]/div/div/div[5]/div/a/div/span")
all_review.click()

In [52]:
page_url=[]

url=driver.find_elements_by_xpath("//nav[@class='yFHi8N']//a")
for i in url:
    page_url.append(i.get_attribute('href'))
page_url=page_url[0:13]

In [53]:
rating=[]
review_summary=[]
full_review=[]

for i in page_url:

    rating_tags=driver.find_elements_by_xpath("//div[@class='_3LWZlK _1BLPMq']")
    for i in rating_tags:
        rate=i.text
        rating.append(rate)
 
    review_tags=driver.find_elements_by_xpath("//p[@class='_2-N8zT']")
    for i in review_tags:
        review=i.text
        review_summary.append(review)

    fullreview_tags=driver.find_elements_by_xpath("//div[@class='t-ZTKy']")
    for i in fullreview_tags:
        fullreview=i.text
        full_review.append(fullreview)

In [54]:
print(len(rating),len(review_summary),len(full_review))

110 110 110

In [55]:
flipkartr=pd.DataFrame({})
flipkartr['rating']=rating[0:100]
flipkartr['review_summary']=review_summary[0:100]
flipkartr['full_review']=full_review[0:100]
flipkartr

,rating,review_summary,full_review
0,5,Brilliant,The Best Phone for the Money\n\nThe iPhone 11 ...
1,5,Simply awesome,Really satisfied with the Product I received.....
2,5,Best in the market!,Great iPhone very snappy experience as apple k...
3,5,Perfect product!,Amazing phone with great cameras and better ba...
4,5,Fabulous!,This is my first iOS phone. I am very happy wi...
...,...,...,...
95,5,Worth every penny,Previously I was using one plus 3t it was a gr...
96,5,Great product,Amazing Powerful and Durable Gadget.\n\nI’m am...
97,5,Highly recommended,What a camera .....just awesome ..you can feel...
98,4,Good choice,So far it’s been an AMAZING experience coming ...
99,5,Worth every penny,"i11 is worthy to buy, too much happy with the ..."

In [56]:
driver.close()

# 6

In [57]:
import numpy as np
import pandas as pd
from time import sleep
from random import randint
from selenium import webdriver
import warnings
warnings.filterwarnings('ignore')

driver = webdriver.Chrome(r"C:\Users\Konghot Vineeth Nair\Desktop\chromedriver.exe")
driver.get('https://www.flipkart.com')

In [58]:
search_shoe = driver.find_element_by_xpath("//div[@class='_3OO5Xc']/input")
search_shoe.send_keys("sneakers") 
search_btn = driver.find_element_by_xpath("//button[@class='L0Z3Pu']")
search_btn.click()

In [59]:
# specifying the url of the webpage to be scraped
url = "https://www.flipkart.com/search?q=sneakers&otracker=search&otracker1=search&marketplace=FLIPKART&as-show=on&as=off"
driver.get(url)

page_url=[]
url=driver.find_elements_by_xpath("//nav[@class='yFHi8N']//a")
for i in url:
    page_url.append(i.get_attribute('href'))
page_url=page_url[0:5]

In [60]:
Brand=[]
Description=[]
Price=[]
Discount=[] 

# extracting all the tags

for i in page_url:
    driver.get(i)
    titles_brand=driver.find_elements_by_xpath("//div[@class='_2WkVRV']")
    for i in titles_brand:
        Brand.append(i.text)
        
    titles_Description=driver.find_elements_by_xpath("//a[@class='IRpwTa']")
    for i in titles_Description:
        Description.append(i.text)
        
    titles_Price=driver.find_elements_by_xpath("//div[@class='_30jeq3']")
    for i in titles_Price:
        Price.append(i.text.replace("₹",""))
        
    titles_Discount=driver.find_elements_by_xpath("//div[@class='_3Ay6Sb']/span")
    for i in titles_Discount:
        Discount.append(i.text.replace("% off",""))

In [61]:
print(len(Brand),len(Description),len(Price),len(Discount))

200 138 200 199

In [62]:
flipkart=pd.DataFrame({})
flipkart['Brand']=Brand[0:100]
flipkart['Product Description']=Description[0:100]
flipkart['Price-in ₹']=Price[0:100]
flipkart['Discount-in %']=Discount[0:100]
flipkart

,Brand,Product Description,Price-in ₹,Discount-in %
0,BLANCCY,Modern Trendy Sneakers Shoes Sneakers For Men,449,55
1,BOOYO,Combo Pack Of 4 Casual Shoes Loafer Shoes Snea...,455,74
2,Elevarse,Sneakers For Men,349,65
3,BRUTON,Classy Stylish Sneakers Sneakers For Women,259,80
4,BRUTON,Combo Pack Of 2 Latest Stylish Casual Shoes fo...,499,85
...,...,...,...,...
95,kcandy,Sneakers For Women,182,55
96,PUMA,Sneakers For Women,"1,452",82
97,BRUTON,Sneakers For Men,449,57
98,Robbie jones,Sneakers For Men,428,36
99,RapidBox,Perfect Stylish Casual Shoes For Girls & Women...,630,15

In [63]:
driver.close()

# 7

In [64]:
#import libraries
import selenium
from selenium import webdriver
import pandas as pd
from time import sleep
from random import randint
import warnings
warnings.filterwarnings('ignore')

driver = webdriver.Chrome(executable_path=r"C:\Users\Konghot Vineeth Nair\Desktop\chromedriver.exe")
driver.get("https://www.myntra.com/shoes")

In [65]:
price = driver.find_element_by_xpath("/html/body/div[2]/div/div[1]/main/div[3]/div[1]/section/div/div[5]/ul/li[2]/label") 
price.click()

In [66]:
color = driver.find_element_by_xpath("//html/body/div[2]/div/div[1]/main/div[3]/div[1]/section/div/div[6]/ul/li[1]/label") 
color.click()

In [67]:
url = "https://www.myntra.com/shoes?f=Color%3ABlack_36454f&rf=Price%3A7149.0_14099.0_7149.0%20TO%2014099.0"
driver.get(url)

page_url=[]

url=driver.find_elements_by_xpath("//li[@class='pagination-number']//a")
for i in url:
    page_url.append(i.get_attribute('href'))
page_url=page_url[0:2]

In [68]:
Brand=[]
Description=[]
Price=[]

# extracting all the tags

for i in page_url:
    driver.get(i)
    titles_brand=driver.find_elements_by_xpath("//h3[@class='product-brand']")
    for i in titles_brand:
        Brand.append(i.text)
    
    titles_Description=driver.find_elements_by_xpath("//h4[@class='product-product']")
    for i in titles_Description:
        Description.append(i.text)
        
    titles_Price=driver.find_elements_by_xpath("//div[@class='product-price']")
    for i in titles_Price:
        Price.append(i.text)

In [69]:
Shoes =pd.DataFrame({})
Shoes['Brand']=Brand[0:100]
Shoes['Shoe Description']=Description[0:100]
Shoes['Price']=Price[0:100]
Shoes

,Brand,Shoe Description,Price
0,New Balance,Women Woven Running Shoes,Rs. 7149Rs. 12999(45% OFF)
1,Columbia,Men FACET OUTDRY Trekking Shoe,Rs. 12999
2,Columbia,PEAKFREAK OUTDRY Trekking Shoe,Rs. 9999
3,J.FONTINI,Men Textured Leather Loafers,Rs. 7990
4,J.FONTINI,Men Textured Leather Loafers,Rs. 8490
...,...,...,...
95,Saint G,Leather High-Top Heeled Boots,Rs. 9730Rs. 13900(30% OFF)
96,Pavers England,Men Solid Leather Formal Loafers,Rs. 7999
97,ADIDAS,Men Supernova + Running Shoes,Rs. 10199Rs. 11999(15% OFF)
98,ADIDAS Originals,Unisex Superstar Slip on,Rs. 7999
99,Kenkoh,Women Open Toe Flats,Rs. 9690

In [70]:
driver.close()

# 8

In [71]:
#import libraries
import selenium
from selenium import webdriver
import pandas as pd
from time import sleep
from random import randint
import warnings
warnings.filterwarnings('ignore')

driver = webdriver.Chrome(executable_path=r"C:\Users\Konghot Vineeth Nair\Desktop\chromedriver.exe")
driver.get("https://www.amazon.in/")

In [72]:
search_product = driver.find_element_by_xpath("/html/body/div[1]/header/div/div[1]/div[2]/div/form/div[2]/div[1]/input")
search_product.send_keys("laptop")
search_btn = driver.find_element_by_xpath("/html/body/div[1]/header/div/div[1]/div[2]/div/form/div[3]/div/span/input")
search_btn.click()

In [73]:
i7_clk=driver.find_elements_by_xpath("//span[@class='a-size-base a-color-base']")
for i in i7_clk:
    if i.text == 'Intel Core i7':   
        i.click() # Checking the checkbox to apply filter on the laptop
        break

In [74]:
i9_clk=driver.find_elements_by_xpath("//span[@class='a-size-base a-color-base']")
for i in i9_clk:
    if i.text == 'Intel Core i9':   
        i.click() # Checking the checkbox to apply filter on the laptop
        break

In [75]:
url = "https://www.amazon.in/s?k=laptop&rh=n%3A1375424031%2Cp_n_feature_thirteen_browse-bin%3A12598163031&dc&crid=21IOHOWP8A93P&qid=1645544620&rnid=12598141031&sprefix=laptop%2Caps%2C1074&ref=sr_nr_p_n_feature_thirteen_browse-bin_12"

driver.get(url)

In [76]:
Title=[]
Rating=[]
Price=[]

# extracting all the tags

titles=driver.find_elements_by_xpath("//h2[@class='a-size-mini a-spacing-none a-color-base s-line-clamp-2']")
for i in titles:
    Title.append(i.text)
    
titles_rat=driver.find_elements_by_xpath("//div[@class='a-row a-size-small']/span")
for i in titles_rat:
    Rating.append(i.get_attribute("aria-label"))
        
titles_Price=driver.find_elements_by_xpath("//span[@class='a-price']")
for i in titles_Price:
    Price.append(i.text[1:])

In [77]:
rating=[]
for i in range(0,len(Rating)):
    if i == 0 or  i/2 == i//2:
        rating.append(Rating[i][0:3])

In [78]:
print(len(Title),len(rating),len(Price))

30 25 29

In [79]:
amazon =pd.DataFrame({})
amazon['Title']=Title[0:10]
amazon['Rating']=rating[0:10]
amazon['Price']=Price[0:10]
amazon

                                               Title Rating     Price
0  LG Gram 16 inches Intel Evo 11th Gen Core i7 U...    4.4    92,999
1  Mi Notebook Ultra 3.2K resolution display Inte...    4.3    77,999
2  ASUS VivoBook 14 (2021), 14-inch (35.56 cms) F...    4.3    59,990
3  HP Pavilion x360 11th Gen Intel Core i7 14 inc...    4.6    86,990
4  ASUS TUF Gaming F15 (2021) 15.6-inch (39.62 cm...    4.3    96,990
5  Dell 15 (2021) i7-11390H, 16GB, 1TB SSD, Win 1...    4.2    89,990
6  Acer Predator Helios 300 Gaming Laptop 11th Ge...    4.5  1,39,413
7  Mi Notebook Horizon Edition 14 Intel Core i7-1...    4.1    57,990
8  MSI GF75 Thin Gaming, Intel Core i7-10750H, 44...    4.4    70,000
9  Acer Nitro 5 11th Gen Intel Core i5-11400H 15....    4.0    65,990

In [80]:
driver.close()

# 9

In [92]:
#import libraries
import selenium
from selenium import webdriver
import pandas as pd
from time import sleep
from random import randint
import warnings
warnings.filterwarnings('ignore')

driver = webdriver.Chrome(executable_path=r"C:\Users\Konghot Vineeth Nair\Desktop\chromedriver.exe")
driver.get("https://www.ambitionbox.com/")

In [93]:
#Job selection
job = driver.find_element_by_xpath("/html/body/div[1]/nav/nav/a[6]")
job.click()

In [94]:
#Search
search_title = driver.find_element_by_xpath("//span[@class='twitter-typeahead']/input")
search_title.send_keys("Data Scientist")

search_btn = driver.find_element_by_xpath("//button[@class='ab_btn search-btn round']")
search_btn.click()

In [96]:
#location
place = driver.find_element_by_xpath("/html/body/div/div/div/div[2]/div[2]/div[1]/div/div/div/div[2]/div[1]/i") # Location dropdown
place.click()    
search_loc = driver.find_element_by_xpath("/html/body/div/div/div/div[2]/div[2]/div[1]/div/div/div/div[2]/div[2]/div/div[2]/input")
search_loc.send_keys("noida")
search_loc1 = driver.find_element_by_xpath("/html/body/div/div/div/div[2]/div[2]/div[1]/div/div/div/div[2]/div[2]/div/div[3]/div[1]/div[1]/div/label")
search_loc1.click()

In [97]:
#creating empty list
comp_name = []
job_post = []
rating = []

company=driver.find_elements_by_xpath("//div[@class='company-info']")
for i in company:
    comp_name.append(i.text.split("\n")[0])
    rating.append(i.text.split("\n")[1])
    
posted=driver.find_elements_by_xpath("//span[@class='body-small-l']")
for i in posted:
    job_post.append(i.text)

posted=[]
for i in range(0,len(job_post)):
    if i == 0 or  i/2 == i//2:
        posted.append(job_post[i])

In [98]:
ambition = pd.DataFrame({})
ambition["Company_name"] = comp_name[1:]
ambition["Job Posted"] = posted
ambition["Rating"] = rating[1:]
ambition

                     Company_name Job Posted Rating
0                    Walmart Labs     1d ago    4.1
1                    Walmart Labs     4d ago    4.1
2          IBM India Pvt. Limited     4d ago    4.1
3          IBM India Pvt. Limited     4d ago    4.1
4                 JP Morgan Chase     3d ago    4.1
5          IBM India Pvt. Limited     5d ago    4.1
6          IBM India Pvt. Limited     5d ago    4.1
7  Intel Technology India Pvt Ltd     7d ago    4.3
8          IBM India Pvt. Limited     6d ago    4.1
9          IBM India Pvt. Limited     6d ago    4.1

In [99]:
driver.close()

# 10

In [100]:
#import libraries
import selenium
from selenium import webdriver
import pandas as pd
from time import sleep
from random import randint
import warnings
warnings.filterwarnings('ignore')

driver = webdriver.Chrome(executable_path=r"C:\Users\Konghot Vineeth Nair\Desktop\chromedriver.exe")
driver.get("https://www.ambitionbox.com/")

In [101]:
#salaries option selection
salary_option = driver.find_element_by_xpath("/html/body/div[1]/nav/nav/a[4]")
salary_option.click()

In [102]:
#Search Data Scientist”
search_title = driver.find_element_by_xpath("/html/body/div/div/div/div[2]/div/div/div/div[1]/span/input")
search_title.send_keys("Data Scientist")
clk=driver.find_elements_by_xpath("//div[@class='suggestion_wrap tt-suggestion tt-selectable']")
for i in clk:
    if i.text == 'Data Scientist':   
        i.click()
        break

In [103]:
name = []
salary_record = []
avg_salary = []
min_salary = []
max_salary = []
exp = []

company=driver.find_elements_by_xpath("//div[@class='company-info']")
for i in company:
    name.append(i.text.split("\n")[0])                             
    salary_record.append(i.text.replace("based on", " ").replace("salaries","").split("\n")[1:2]) 
    exp.append(i.text.replace("yrs exp","").replace("yr exp","").split("\n")[-1])                
    
average_salary=driver.find_elements_by_xpath("//div[@class='average-indicator-wrapper']")
for i in average_salary:
    avg_salary.append(i.text.replace("₹","").replace("L",""))           

salary=driver.find_elements_by_xpath("//div[@class='salary-values']")
for i in salary:
    min_salary.append(i.text.replace("₹","").replace("L","").split("\n")[0]) 
    max_salary.append(i.text.replace("₹","").replace("L","").split("\n")[1])

In [104]:
details=pd.DataFrame({})
details["Company"] = name[:10]
details["Total Salary"] = salary_record[:10]
details["Experience_Required"] = exp[:10]
details["Average_Salary_L"] = avg_salary[:10]
details["Minimum_Salary_L"] = min_salary
details["Maximum_Salary_L"] = max_salary
details

,Company,Total Salary,Experience_Required,Average_Salary_L,Minimum_Salary_L,Maximum_Salary_L
0,Tekion,[ 10 ],4,23.3,14.0,32.0
1,Microsoft Corporation,[ 227 ],1-4,23.1,13.0,45.0
2,Goldman Sachs,[ 12 ],2,22.1,16.0,30.0
3,Flipkart,[ 53 ],1-4,20.9,7.5,30.0
4,PayPal,[ 22 ],1-2,20.0,12.0,28.4
5,Amazon,[ 89 ],1-4,19.3,8.0,41.5
6,Servicenow Software Development India,[ 41 ],2-4,19.0,12.0,25.8
7,Arcesium,[ 48 ],1-2,18.4,12.0,30.0
8,Walmart,[ 82 ],1-4,18.0,10.0,32.0
9,ServiceNow,[ 18 ],3,17.3,11.0,23.0

In [105]:
driver.close()